app/controllers/friends_controller.rb

SELECT "users".* FROM "users" WHERE (first_name LIKE '%guilherme diel%' OR last_name LIKE '%guilherme diel%' OR email like '%guilherme diel%') LIMIT ?  [["LIMIT", 11]]
SELECT "users".* FROM "users" WHERE "users"."friend_id" = ?  [["friend_id", 4]]
---
  def index
    search_term = params[:search]

    if search_term.nil? or search_term.empty?
      @friends = []
    else
      terms = search_term.split
      @friends = User.where("first_name LIKE ? OR last_name LIKE ? OR email LIKE ?", "%#{terms[0]}%", "%#{terms[0]}%", "%#{terms[0]}%")

      terms.drop(1).each do |term|
        @friends = @friends.or(User.where("first_name LIKE ? OR last_name LIKE ? OR email LIKE ?", "%#{term}%", "%#{term}%", "%#{term}%"))

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" IS NULL
SELECT 1 AS one FROM "posts" WHERE (user_id = NULL AND public = true) LIMIT ?  [["LIMIT", 1]]
---
  def friendProfile

    if !Post.where("user_id = ? AND public = true", params[:friend_id]).empty?

SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", "1"]]
INSERT INTO "friends" ("user_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", "6"], ["friend_id", "1"], ["created_at", "2023-06-12 18:39:28.790516"], ["updated_at", "2023-06-12 18:39:28.790516"]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ? AND "friends"."friend_id" = ? LIMIT ?  [["user_id", "1"], ["friend_id", "5"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
    @friends = []
    Friend.where(user_id: current_user.id).each do |friend|
      @friends << User.find(friend.friend_id)

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "friends" ("user_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", "4"], ["friend_id", "4"], ["created_at", "2023-06-07 13:14:28.141015"], ["updated_at", "2023-06-07 13:14:28.141015"]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ? AND "friends"."friend_id" = ? LIMIT ?  [["user_id", "1"], ["friend_id", "2"], ["LIMIT", 1]]
---
  def create_friendship
    friend = User.find(params[:friend_id])
    Friend.create(user_id: current_user.id, friend_id: friend.id) unless Friend.find_by(user_id: current_user.id, friend_id: friend.id)

SELECT "friends".* FROM "friends" WHERE "friends"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
    def set_friend
      @friend = Friend.find_by(id: params[:id])