app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
  def index
    @posts = Post.where(user_id: current_user.id)

SELECT "posts".* FROM "posts"
---
  def new
    @posts = Post.all

INSERT INTO "posts" ("title", "user_id", "summary", "content", "feeling", "created_at", "updated_at", "time", "day") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)

    @post.user = current_user

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "summary" = ?, "content" = ?, "feeling" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "USER"], ["summary", "USER"], ["content", "USER"], ["feeling", "USER"], ["updated_at", "2023-05-16 12:20:40.877223"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)