app/controllers/welcome_controller.rb

  def index
    if user_signed_in?
      @post = current_user.posts if !current_user.posts.empty? else [] end
---
SELECT 1 AS one FROM "posts" WHERE "posts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]